In [2]:
import pandas as pd

In [10]:
df = pd.DataFrame({'c1':['a','b','c','d','e','f','g','h','i','j'],'c2':[10,12,23,4,18,98,11,23,33,99]})
df

  c1  c2
0  a  10
1  b  12
2  c  23
3  d   4
4  e  18
5  f  98
6  g  11
7  h  23
8  i  33
9  j  99

In [11]:
list1 = pd.Series(['f','j','98','99'])
list1

0     f
1     j
2    98
3    99
dtype: object

How to create a new data frame that contains rows where c1 is in list1.

In [12]:
df1 = pd.DataFrame({'c1':['f','j'],'c2':[98,99]})
df1

  c1  c2
0  f  98
1  j  99